apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_syscon.h
/********************************************************************************************
 * arch/arm/src/lpc55xx/chip/lpc55_syscon.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC55XX_HARDWARE_LPC55_SYSCON_H
#define __ARCH_ARM_SRC_LPC55XX_HARDWARE_LPC55_SYSCON_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>
#include "hardware/lpc55_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Register offsets *************************************************************************/

/* Main system configuration */

#define LPC55_SYSCON_MEMREMAPCTRL_OFFSET       0x0000  /* AHB multilayer matrix priority control */
#define LPC55_SYSCON_AHBMATPRIO_OFFSET         0x0010  /* AHB multilayer matrix priority control */
#define LPC55_SYSCON_SYSTCKCALSEC_OFFSET       0x0040  /* System tick counter calibration (secure) */
#define LPC55_SYSCON_SYSTCKCALNSEC_OFFSET      0x0040  /* System tick counter calibration (non-secure) */
#define LPC55_SYSCON_NMISRC_OFFSET             0x0048  /* NMI source select */
#define LPC55_SYSCON_PRESETCTRL0_OFFSET        0x0100  /* Peripheral reset control 0 */
#define LPC55_SYSCON_PRESETCTRL1_OFFSET        0x0104  /* Peripheral reset control 1 */
#define LPC55_SYSCON_PRESETCTRL2_OFFSET        0x0108  /* Peripheral reset control 2 */
#define LPC55_SYSCON_PRESETCTRLSET0_OFFSET     0x0120  /* Set bits in PRESETCTRL0 */
#define LPC55_SYSCON_PRESETCTRLSET1_OFFSET     0x0124  /* Set bits in PRESETCTRL1 */
#define LPC55_SYSCON_PRESETCTRLSET2_OFFSET     0x0128  /* Set bits in PRESETCTRL2 */
#define LPC55_SYSCON_PRESETCTRLCLR0_OFFSET     0x0140  /* Clear bits in PRESETCTRL0 */
#define LPC55_SYSCON_PRESETCTRLCLR1_OFFSET     0x0144  /* Clear bits in PRESETCTRL1 */
#define LPC55_SYSCON_PRESETCTRLCLR2_OFFSET     0x0148  /* Clear bits in PRESETCTRL2 */
#define LPC55_SYSCON_SWRRESET_OFFSET           0x0160  /* System reset */
#define LPC55_SYSCON_AHBCLKCTRL0_OFFSET        0x0200  /* AHB Clock control 0 */
#define LPC55_SYSCON_AHBCLKCTRL1_OFFSET        0x0204  /* AHB Clock control 1 */
#define LPC55_SYSCON_AHBCLKCTRL2_OFFSET        0x0208  /* AHB Clock control 2 */
#define LPC55_SYSCON_AHBCLKCTRLSET0_OFFSET     0x0220  /* Set bits in AHBCLKCTRL0 */
#define LPC55_SYSCON_AHBCLKCTRLSET1_OFFSET     0x0224  /* Set bits in AHBCLKCTRL1 */
#define LPC55_SYSCON_AHBCLKCTRLSET2_OFFSET     0x0228  /* Set bits in AHBCLKCTRL2 */
#define LPC55_SYSCON_AHBCLKCTRLCLR0_OFFSET     0x0240  /* Clear bits in AHBCLKCTRL0 */
#define LPC55_SYSCON_AHBCLKCTRLCLR1_OFFSET     0x0244  /* Clear bits in AHBCLKCTRL1 */
#define LPC55_SYSCON_AHBCLKCTRLCLR2_OFFSET     0x0248  /* Clear bits in AHBCLKCTRL2 */
#define LPC55_SYSCON_SYSTICKCLKSEL0_OFFSET     0x0260  /* System Tick Timer for CPU0 source select */
#define LPC55_SYSCON_SYSTICKCLKSEL1_OFFSET     0x0264  /* System Tick Timer for CPU1 source select */
#define LPC55_SYSCON_TRACECLKSEL_OFFSET        0x0268  /* Trace clock source select */
#define LPC55_SYSCON_CTIMER0SRC_OFFSET         0x026c  /* CTimer 0 clock source select */
#define LPC55_SYSCON_CTIMER1SRC_OFFSET         0x0270  /* CTimer 1 clock source select */
#define LPC55_SYSCON_CTIMER2SRC_OFFSET         0x0274  /* CTimer 2 clock source select */
#define LPC55_SYSCON_CTIMER3SRC_OFFSET         0x0278  /* CTimer 3 clock source select */
#define LPC55_SYSCON_CTIMER4SRC_OFFSET         0x027c  /* CTimer 4 clock source select */
#define LPC55_SYSCON_MAINCLKSELA_OFFSET        0x0280  /* Main clock source select A */
#define LPC55_SYSCON_MAINCLKSELB_OFFSET        0x0284  /* Main clock source select B */
#define LPC55_SYSCON_CLKOUTSELA_OFFSET         0x0288  /* CLKOUT clock source select */
#define LPC55_SYSCON_PLL0CLKSEL_OFFSET         0x0290  /* PLL0 clock source select */
#define LPC55_SYSCON_PLL1CLKSEL_OFFSET         0x0294  /* PLL1 clock source select */
#define LPC55_SYSCON_ADCCLKSEL_OFFSET          0x02a4  /* ADC clock source select */
#define LPC55_SYSCON_USB0CLKSEL_OFFSET         0x02a8  /* FS USB clock source select */
#define LPC55_SYSCON_FCLKSEL0_OFFSET           0x02b0  /* Flexcomm Interface 0 clock source select */
#define LPC55_SYSCON_FCLKSEL1_OFFSET           0x02b4  /* Flexcomm Interface 1 clock source select */
#define LPC55_SYSCON_FCLKSEL2_OFFSET           0x02b8  /* Flexcomm Interface 2 clock source select */
#define LPC55_SYSCON_FCLKSEL3_OFFSET           0x02bc  /* Flexcomm Interface 3 clock source select */
#define LPC55_SYSCON_FCLKSEL4_OFFSET           0x02c0  /* Flexcomm Interface 4 clock source select */
#define LPC55_SYSCON_FCLKSEL5_OFFSET           0x02c4  /* Flexcomm Interface 5 clock source select */
#define LPC55_SYSCON_FCLKSEL6_OFFSET           0x02c8  /* Flexcomm Interface 6 clock source select */
#define LPC55_SYSCON_FCLKSEL7_OFFSET           0x02cc  /* Flexcomm Interface 7 clock source select */
#define LPC55_SYSCON_HSLSPICLKSEL_OFFSET       0x02d0  /* HS SPI clock source select */
#define LPC55_SYSCON_MCLKCLKSEL_OFFSET         0x02e0  /* MCLK clock source select */
#define LPC55_SYSCON_SCTCLKSEL_OFFSET          0x02f0  /* SCTimer/PWM clock source select */
#define LPC55_SYSCON_SDIOCLKSEL_OFFSET         0x02f8  /* SDIO clock source select */
#define LPC55_SYSCON_SYSTICKCLKDIV0_OFFSET     0x0300  /* SYSTICK clock divider CPU 0 */
#define LPC55_SYSCON_SYSTICKCLKDIV1_OFFSET     0x0304  /* SYSTICK clock divider CPU 1 */
#define LPC55_SYSCON_TRACECLKDIV_OFFSET        0x0308  /* ARM Trace clock divider */
#define LPC55_SYSCON_FLEXFRG0CTRL_OFFSET       0x0320  /* Fractional Rate Divider for Flexcomm0 */
#define LPC55_SYSCON_FLEXFRG1CTRL_OFFSET       0x0324  /* Fractional Rate Divider for Flexcomm1 */
#define LPC55_SYSCON_FLEXFRG2CTRL_OFFSET       0x0328  /* Fractional Rate Divider for Flexcomm2 */
#define LPC55_SYSCON_FLEXFRG3CTRL_OFFSET       0x032c  /* Fractional Rate Divider for Flexcomm3 */
#define LPC55_SYSCON_FLEXFRG4CTRL_OFFSET       0x0330  /* Fractional Rate Divider for Flexcomm4 */
#define LPC55_SYSCON_FLEXFRG5CTRL_OFFSET       0x0334  /* Fractional Rate Divider for Flexcomm5 */
#define LPC55_SYSCON_FLEXFRG6CTRL_OFFSET       0x0338  /* Fractional Rate Divider for Flexcomm6 */
#define LPC55_SYSCON_FLEXFRG7CTRL_OFFSET       0x033c  /* Fractional Rate Divider for Flexcomm7 */
#define LPC55_SYSCON_AHBCLKDIV_OFFSET          0x0380  /* System clock divider */
#define LPC55_SYSCON_CLKOUTDIV_OFFSET          0x0384  /* CLKOUT clock divider */
#define LPC55_SYSCON_FROHFDIV_OFFSET           0x0388  /* FROHF clock divider */
#define LPC55_SYSCON_ADCCLKDIV_OFFSET          0x0394  /* ADC clock divider */
#define LPC55_SYSCON_USB0CLKDIV_OFFSET         0x0398  /* USB0 clock divider */
#define LPC55_SYSCON_FRGCTRL_OFFSET            0x03a0  /* Fractional rate divider */
#define LPC55_SYSCON_MCLKDIV_OFFSET            0x03ac  /* I2S MCLK clock divider */
#define LPC55_SYSCON_SCTCLKDIV_OFFSET          0x03b4  /* SCT/PWM clock divider */
#define LPC55_SYSCON_SDIOCLKDIV_OFFSET         0x03bc  /* SDIO clock divider */
#define LPC55_SYSCON_PLL0CLKDIV_OFFSET         0x03c4  /* PLL0 clock divider */
#define LPC55_SYSCON_CLOCKGENUPDATELOCK_OFFSET 0x03fc  /* Control clock configuration registers access */
#define LPC55_SYSCON_FMCCR_OFFSET              0x0400  /* FMC configuration */
#define LPC55_SYSCON_USB0CLKCTRL_OFFSET        0x040c  /* USB0 clock control */
#define LPC55_SYSCON_USB0CLKSTAT_OFFSET        0x0410  /* USB0 clock status */
#define LPC55_SYSCON_FMCFLUSH_OFFSET           0x041c  /* FMC flush control */
#define LPC55_SYSCON_MCLKIO_OFFSET             0x0420  /* MCLK input/output control */
#define LPC55_SYSCON_USB1CLKCTRL_OFFSET        0x0424  /* USB1 clock control */
#define LPC55_SYSCON_USB1CLKSTAT_OFFSET        0x0428  /* USB1 clock status */
#define LPC55_SYSCON_SDIOCLKCTRL_OFFSET        0x0460  /* SDIO CCLKIN phase and delay control */
#define LPC55_SYSCON_PLL1CTRL_OFFSET           0x0560  /* PLL1 control */
#define LPC55_SYSCON_PLL1STAT_OFFSET           0x0564  /* PLL1 status */
#define LPC55_SYSCON_PLL1NDEC_OFFSET           0x0568  /* PLL1 N divider */
#define LPC55_SYSCON_PLL1MDEC_OFFSET           0x056c  /* PLL1 M divider */
#define LPC55_SYSCON_PLL1PDEC_OFFSET           0x0580  /* PLL1 P divider */
#define LPC55_SYSCON_PLL0CTRL_OFFSET           0x0580  /* PLL0 control */
#define LPC55_SYSCON_PLL0STAT_OFFSET           0x0584  /* PLL0 status */
#define LPC55_SYSCON_PLL0NDEC_OFFSET           0x0588  /* PLL0 N divider */
#define LPC55_SYSCON_PLL0PDEC_OFFSET           0x058c  /* PLL0 P divider */
#define LPC55_SYSCON_PLL0SSCG0_OFFSET          0x0590  /* System PLL Spread Spectrum Wrapper control 0 */
#define LPC55_SYSCON_PLL0SSCG1_OFFSET          0x0594  /* System PLL Spread Spectrum Wrapper control 1 */
#define LPC55_SYSCON_CPUCTRL_OFFSET            0x0800  /* CPU control for multiple processors */
#define LPC55_SYSCON_CPBOOT_OFFSET             0x0804  /* Coprocessor boot address */
#define LPC55_SYSCON_CPUSTAT_OFFSET            0x080c  /* CPU status */
#define LPC55_SYSCON_CLOCKCTRL_OFFSET          0x0a18  /* Various system clock controls */
#define LPC55_SYSCON_COMPINTCTRL_OFFSET        0x0b10  /* Comparator interrupt control */
#define LPC55_SYSCON_COMPINTSTAUS_OFFSET       0x0b14  /* Comparator interrupt status */
#define LPC55_SYSCON_AUTOCLKGATEOVER_OFFSET    0x0e04  /* Control automatic clock gating */
#define LPC55_SYSCON_GPIOPSYNC_OFFSET          0x0e08  /* Bypass of first stage of sync in GPIO_INT */
#define LPC55_SYSCON_DEBUGLOCKEN_OFFSET        0x0fa0  /* Control write access to sec regs */
#define LPC55_SYSCON_DEBUGLFEATURES_OFFSET     0x0fa4  /* CPU0/1 debug feature control */
#define LPC55_SYSCON_SWDACCESSCPU0_OFFSET      0x0fb4  /* Enable SWD for CPU0 */
#define LPC55_SYSCON_SWDACCESSCPU1_OFFSET      0x0fb8  /* Enable SWD for CPU1 */
#define LPC55_SYSCON_KEYBLOCK_OFFSET           0x0fbc  /* Block access to PUF indexes */
#define LPC55_SYSCON_DEBUGAUTHBEACON_OFFSET    0x0fc0  /* Debug authentication BEACON */
#define LPC55_SYSCON_CPUCFG_OFFSET             0x0fd4  /* CPU configuration */
#define LPC55_SYSCON_DEVICE_ID0_OFFSET         0x0ff8  /* Part ID */
#define LPC55_SYSCON_DIEID_OFFSET              0x0ffc  /* Boot ROM and die revision */

/* Register addresses ***********************************************************************/

/* Main system configuration */

#define LPC55_SYSCON_MEMREMAPCTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_MEMREMAPCTRL_OFFSET)       
#define LPC55_SYSCON_AHBMATPRIO                (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBMATPRIO_OFFSET)         
#define LPC55_SYSCON_SYSTCKCALSEC              (LPC55_SYSCON_BASE + LPC55_SYSCON_SYSTCKCALSEC_OFFSET)       
#define LPC55_SYSCON_SYSTCKCALNSEC             (LPC55_SYSCON_BASE + LPC55_SYSCON_SYSTCKCALNSEC_OFFSET)      
#define LPC55_SYSCON_NMISRC                    (LPC55_SYSCON_BASE + LPC55_SYSCON_NMISRC_OFFSET)             
#define LPC55_SYSCON_PRESETCTRL0               (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRL0_OFFSET)        
#define LPC55_SYSCON_PRESETCTRL1               (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRL1_OFFSET)        
#define LPC55_SYSCON_PRESETCTRL2               (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRL2_OFFSET)        
#define LPC55_SYSCON_PRESETCTRLSET0            (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRLSET0_OFFSET)     
#define LPC55_SYSCON_PRESETCTRLSET1            (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRLSET1_OFFSET)     
#define LPC55_SYSCON_PRESETCTRLSET2            (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRLSET2_OFFSET)     
#define LPC55_SYSCON_PRESETCTRLCLR0            (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRLCLR0_OFFSET)     
#define LPC55_SYSCON_PRESETCTRLCLR1            (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRLCLR1_OFFSET)     
#define LPC55_SYSCON_PRESETCTRLCLR2            (LPC55_SYSCON_BASE + LPC55_SYSCON_PRESETCTRLCLR2_OFFSET)     
#define LPC55_SYSCON_SWRRESET                  (LPC55_SYSCON_BASE + LPC55_SYSCON_SWRRESET_OFFSET)           
#define LPC55_SYSCON_AHBCLKCTRL0               (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRL0_OFFSET)        
#define LPC55_SYSCON_AHBCLKCTRL1               (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRL1_OFFSET)        
#define LPC55_SYSCON_AHBCLKCTRL2               (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRL2_OFFSET)        
#define LPC55_SYSCON_AHBCLKCTRLSET0            (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRLSET0_OFFSET)     
#define LPC55_SYSCON_AHBCLKCTRLSET1            (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRLSET1_OFFSET)     
#define LPC55_SYSCON_AHBCLKCTRLSET2            (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRLSET2_OFFSET)     
#define LPC55_SYSCON_AHBCLKCTRLCLR0            (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRLCLR0_OFFSET)     
#define LPC55_SYSCON_AHBCLKCTRLCLR1            (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRLCLR1_OFFSET)     
#define LPC55_SYSCON_AHBCLKCTRLCLR2            (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKCTRLCLR2_OFFSET)     
#define LPC55_SYSCON_SYSTICKCLKSEL0            (LPC55_SYSCON_BASE + LPC55_SYSCON_SYSTICKCLKSEL0_OFFSET)     
#define LPC55_SYSCON_SYSTICKCLKSEL1            (LPC55_SYSCON_BASE + LPC55_SYSCON_SYSTICKCLKSEL1_OFFSET)     
#define LPC55_SYSCON_TRACECLKSEL               (LPC55_SYSCON_BASE + LPC55_SYSCON_TRACECLKSEL_OFFSET)        
#define LPC55_SYSCON_CTIMER0SRC                (LPC55_SYSCON_BASE + LPC55_SYSCON_CTIMER0SRC_OFFSET)         
#define LPC55_SYSCON_CTIMER1SRC                (LPC55_SYSCON_BASE + LPC55_SYSCON_CTIMER1SRC_OFFSET)         
#define LPC55_SYSCON_CTIMER2SRC                (LPC55_SYSCON_BASE + LPC55_SYSCON_CTIMER2SRC_OFFSET)         
#define LPC55_SYSCON_CTIMER3SRC                (LPC55_SYSCON_BASE + LPC55_SYSCON_CTIMER3SRC_OFFSET)         
#define LPC55_SYSCON_CTIMER4SRC                (LPC55_SYSCON_BASE + LPC55_SYSCON_CTIMER4SRC_OFFSET)         
#define LPC55_SYSCON_MAINCLKSELA               (LPC55_SYSCON_BASE + LPC55_SYSCON_MAINCLKSELA_OFFSET)        
#define LPC55_SYSCON_MAINCLKSELB               (LPC55_SYSCON_BASE + LPC55_SYSCON_MAINCLKSELB_OFFSET)        
#define LPC55_SYSCON_CLKOUTSELA                (LPC55_SYSCON_BASE + LPC55_SYSCON_CLKOUTSELA_OFFSET)         
#define LPC55_SYSCON_PLL0CLKSEL                (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0CLKSEL_OFFSET)         
#define LPC55_SYSCON_PLL1CLKSEL                (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL1CLKSEL_OFFSET)         
#define LPC55_SYSCON_ADCCLKSEL                 (LPC55_SYSCON_BASE + LPC55_SYSCON_ADCCLKSEL_OFFSET)          
#define LPC55_SYSCON_USB0CLKSEL                (LPC55_SYSCON_BASE + LPC55_SYSCON_USB0CLKSEL_OFFSET)         
#define LPC55_SYSCON_FCLKSEL0                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL0_OFFSET)           
#define LPC55_SYSCON_FCLKSEL1                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL1_OFFSET)           
#define LPC55_SYSCON_FCLKSEL2                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL2_OFFSET)           
#define LPC55_SYSCON_FCLKSEL3                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL3_OFFSET)           
#define LPC55_SYSCON_FCLKSEL4                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL4_OFFSET)           
#define LPC55_SYSCON_FCLKSEL5                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL5_OFFSET)           
#define LPC55_SYSCON_FCLKSEL6                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL6_OFFSET)           
#define LPC55_SYSCON_FCLKSEL7                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FCLKSEL7_OFFSET)           
#define LPC55_SYSCON_HSLSPICLKSEL              (LPC55_SYSCON_BASE + LPC55_SYSCON_HSLSPICLKSEL_OFFSET)       
#define LPC55_SYSCON_MCLKCLKSEL                (LPC55_SYSCON_BASE + LPC55_SYSCON_MCLKCLKSEL_OFFSET)         
#define LPC55_SYSCON_SCTCLKSEL                 (LPC55_SYSCON_BASE + LPC55_SYSCON_SCTCLKSEL_OFFSET)          
#define LPC55_SYSCON_SDIOCLKSEL                (LPC55_SYSCON_BASE + LPC55_SYSCON_SDIOCLKSEL_OFFSET)         
#define LPC55_SYSCON_SYSTICKCLKDIV0            (LPC55_SYSCON_BASE + LPC55_SYSCON_SYSTICKCLKDIV0_OFFSET)     
#define LPC55_SYSCON_SYSTICKCLKDIV1            (LPC55_SYSCON_BASE + LPC55_SYSCON_SYSTICKCLKDIV1_OFFSET)     
#define LPC55_SYSCON_TRACECLKDIV               (LPC55_SYSCON_BASE + LPC55_SYSCON_TRACECLKDIV_OFFSET)        
#define LPC55_SYSCON_FLEXFRG0CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG0CTRL_OFFSET)       
#define LPC55_SYSCON_FLEXFRG1CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG1CTRL_OFFSET)       
#define LPC55_SYSCON_FLEXFRG2CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG2CTRL_OFFSET)       
#define LPC55_SYSCON_FLEXFRG3CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG3CTRL_OFFSET)       
#define LPC55_SYSCON_FLEXFRG4CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG4CTRL_OFFSET)       
#define LPC55_SYSCON_FLEXFRG5CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG5CTRL_OFFSET)       
#define LPC55_SYSCON_FLEXFRG6CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG6CTRL_OFFSET)       
#define LPC55_SYSCON_FLEXFRG7CTRL              (LPC55_SYSCON_BASE + LPC55_SYSCON_FLEXFRG7CTRL_OFFSET)       
#define LPC55_SYSCON_AHBCLKDIV                 (LPC55_SYSCON_BASE + LPC55_SYSCON_AHBCLKDIV_OFFSET)          
#define LPC55_SYSCON_CLKOUTDIV                 (LPC55_SYSCON_BASE + LPC55_SYSCON_CLKOUTDIV_OFFSET)          
#define LPC55_SYSCON_FROHFDIV                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FROHFDIV_OFFSET)           
#define LPC55_SYSCON_ADCCLKDIV                 (LPC55_SYSCON_BASE + LPC55_SYSCON_ADCCLKDIV_OFFSET)          
#define LPC55_SYSCON_USB0CLKDIV                (LPC55_SYSCON_BASE + LPC55_SYSCON_USB0CLKDIV_OFFSET)         
#define LPC55_SYSCON_FRGCTRL                   (LPC55_SYSCON_BASE + LPC55_SYSCON_FRGCTRL_OFFSET)            
#define LPC55_SYSCON_MCLKDIV                   (LPC55_SYSCON_BASE + LPC55_SYSCON_MCLKDIV_OFFSET)            
#define LPC55_SYSCON_SCTCLKDIV                 (LPC55_SYSCON_BASE + LPC55_SYSCON_SCTCLKDIV_OFFSET)          
#define LPC55_SYSCON_SDIOCLKDIV                (LPC55_SYSCON_BASE + LPC55_SYSCON_SDIOCLKDIV_OFFSET)         
#define LPC55_SYSCON_PLL0CLKDIV                (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0CLKDIV_OFFSET)         
#define LPC55_SYSCON_CLOCKGENUPDATELOCK        (LPC55_SYSCON_BASE + LPC55_SYSCON_CLOCKGENUPDATELOCK_OFFSET) 
#define LPC55_SYSCON_FMCCR                     (LPC55_SYSCON_BASE + LPC55_SYSCON_FMCCR_OFFSET)              
#define LPC55_SYSCON_USB0CLKCTRL               (LPC55_SYSCON_BASE + LPC55_SYSCON_USB0CLKCTRL_OFFSET)        
#define LPC55_SYSCON_USB0CLKSTAT               (LPC55_SYSCON_BASE + LPC55_SYSCON_USB0CLKSTAT_OFFSET)        
#define LPC55_SYSCON_FMCFLUSH                  (LPC55_SYSCON_BASE + LPC55_SYSCON_FMCFLUSH_OFFSET)           
#define LPC55_SYSCON_MCLKIO                    (LPC55_SYSCON_BASE + LPC55_SYSCON_MCLKIO_OFFSET)             
#define LPC55_SYSCON_USB1CLKCTRL               (LPC55_SYSCON_BASE + LPC55_SYSCON_USB1CLKCTRL_OFFSET)        
#define LPC55_SYSCON_USB1CLKSTAT               (LPC55_SYSCON_BASE + LPC55_SYSCON_USB1CLKSTAT_OFFSET)        
#define LPC55_SYSCON_SDIOCLKCTRL               (LPC55_SYSCON_BASE + LPC55_SYSCON_SDIOCLKCTRL_OFFSET)        
#define LPC55_SYSCON_PLL1CTRL                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL1CTRL_OFFSET)           
#define LPC55_SYSCON_PLL1STAT                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL1STAT_OFFSET)           
#define LPC55_SYSCON_PLL1NDEC                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL1NDEC_OFFSET)           
#define LPC55_SYSCON_PLL1MDEC                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL1MDEC_OFFSET)           
#define LPC55_SYSCON_PLL1PDEC                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL1PDEC_OFFSET)           
#define LPC55_SYSCON_PLL0CTRL                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0CTRL_OFFSET)           
#define LPC55_SYSCON_PLL0STAT                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0STAT_OFFSET)           
#define LPC55_SYSCON_PLL0NDEC                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0NDEC_OFFSET)           
#define LPC55_SYSCON_PLL0PDEC                  (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0PDEC_OFFSET)           
#define LPC55_SYSCON_PLL0SSCG0                 (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0SSCG0_OFFSET)          
#define LPC55_SYSCON_PLL0SSCG1                 (LPC55_SYSCON_BASE + LPC55_SYSCON_PLL0SSCG1_OFFSET)          
#define LPC55_SYSCON_CPUCTRL                   (LPC55_SYSCON_BASE + LPC55_SYSCON_CPUCTRL_OFFSET)            
#define LPC55_SYSCON_CPBOOT                    (LPC55_SYSCON_BASE + LPC55_SYSCON_CPBOOT_OFFSET)             
#define LPC55_SYSCON_CPUSTAT                   (LPC55_SYSCON_BASE + LPC55_SYSCON_CPUSTAT_OFFSET)            
#define LPC55_SYSCON_CLOCKCTRL                 (LPC55_SYSCON_BASE + LPC55_SYSCON_CLOCKCTRL_OFFSET)          
#define LPC55_SYSCON_COMPINTCTRL               (LPC55_SYSCON_BASE + LPC55_SYSCON_COMPINTCTRL_OFFSET)        
#define LPC55_SYSCON_COMPINTSTAUS              (LPC55_SYSCON_BASE + LPC55_SYSCON_COMPINTSTAUS_OFFSET)       
#define LPC55_SYSCON_AUTOCLKGATEOVER           (LPC55_SYSCON_BASE + LPC55_SYSCON_AUTOCLKGATEOVER_OFFSET)    
#define LPC55_SYSCON_GPIOPSYNC                 (LPC55_SYSCON_BASE + LPC55_SYSCON_GPIOPSYNC_OFFSET)          
#define LPC55_SYSCON_DEBUGLOCKEN               (LPC55_SYSCON_BASE + LPC55_SYSCON_DEBUGLOCKEN_OFFSET)        
#define LPC55_SYSCON_DEBUGLFEATURES            (LPC55_SYSCON_BASE + LPC55_SYSCON_DEBUGLFEATURES_OFFSET)     
#define LPC55_SYSCON_SWDACCESSCPU0             (LPC55_SYSCON_BASE + LPC55_SYSCON_SWDACCESSCPU0_OFFSET)      
#define LPC55_SYSCON_SWDACCESSCPU1             (LPC55_SYSCON_BASE + LPC55_SYSCON_SWDACCESSCPU1_OFFSET)      
#define LPC55_SYSCON_KEYBLOCK                  (LPC55_SYSCON_BASE + LPC55_SYSCON_KEYBLOCK_OFFSET)           
#define LPC55_SYSCON_DEBUGAUTHBEACON           (LPC55_SYSCON_BASE + LPC55_SYSCON_DEBUGAUTHBEACON_OFFSET)    
#define LPC55_SYSCON_CPUCFG                    (LPC55_SYSCON_BASE + LPC55_SYSCON_CPUCFG_OFFSET)             
#define LPC55_SYSCON_DEVICE_ID0                (LPC55_SYSCON_BASE + LPC55_SYSCON_DEVICE_ID0_OFFSET)         
#define LPC55_SYSCON_DIEID                     (LPC55_SYSCON_BASE + LPC55_SYSCON_DIEID_OFFSET)              

