apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_syscon.h
/* Register bit definitions *****************************************************************/

/* Peripheral reset control 0: PRESETCTRL0, PRESETCTRLSET0, and PRESETCTRLCLR0 */
#define SYSCON_PRESETCTRL0_ROM                 (1 << 1)  /* Bit 3:  Reset the ROM controller */
#define SYSCON_PRESETCTRL0_SRAM1               (1 << 3)  /* Bit 3:  Reset the SRAM 1 controller */
#define SYSCON_PRESETCTRL0_SRAM2               (1 << 4)  /* Bit 4:  Reset the SRAM 2 controller */
#define SYSCON_PRESETCTRL0_SRAM3               (1 << 5)  /* Bit 5:  Reset the SRAM 3 controller */
#define SYSCON_PRESETCTRL0_SRAM4               (1 << 6)  /* Bit 6:  Reset the SRAM 4 controller */
#define SYSCON_PRESETCTRL0_FLASH               (1 << 7)  /* Bit 7:  Reset the flash controller */
#define SYSCON_PRESETCTRL0_FMC                 (1 << 8)  /* Bit 8:  Reset the Flash accelerator */
#define SYSCON_PRESETCTRL0_INPUTMUX            (1 << 11) /* Bit 11: Reset the input muxes */
#define SYSCON_PRESETCTRL0_IOCON               (1 << 13) /* Bit 13: Reset the IOCON block */
#define SYSCON_PRESETCTRL0_GPIO0               (1 << 14) /* Bit 14: Reset the GPIO0 port registers */
#define SYSCON_PRESETCTRL0_GPIO1               (1 << 15) /* Bit 15: Reset the GPIO1 port registers */
#define SYSCON_PRESETCTRL0_PINT                (1 << 18) /* Bit 18: Reset the pin interrupt block */
#define SYSCON_PRESETCTRL0_GINT                (1 << 19) /* Bit 19: Reset the grouped pin interrupt block */
#define SYSCON_PRESETCTRL0_DMA0                (1 << 20) /* Bit 20: Reset the DMA0 controller */
#define SYSCON_PRESETCTRL0_CRC                 (1 << 21) /* Bit 21: Reset the CRC engine */
#define SYSCON_PRESETCTRL0_WWDT                (1 << 22) /* Bit 22: Reset the Watchdog Timer */
#define SYSCON_PRESETCTRL0_RTC                 (1 << 23) /* Bit 23: Enables the bus clock for the RTC */
#define SYSCON_PRESETCTRL0_MAILBOX             (1 << 26) /* Bit 26: Reset the inter CPU comm mailbox */
#define SYSCON_PRESETCTRL0_ADC0                (1 << 27) /* Bit 27: Reset the ADC0 register interface */

/* Peripheral reset control 2: PRESETCTRL1, PRESETCTRLSET1, and PRESETCTRLCLR1 */

#define SYSCON_PRESETCTRL1_MRT                 (1 << 0)  /* Bit 0:  Reset the Multi-Rate Timer */
#define SYSCON_PRESETCTRL1_OSTIMER             (1 << 1)  /* Bit 1:  Reset the OS Event Timer */
#define SYSCON_PRESETCTRL1_SCT0                (1 << 2)  /* Bit 2:  Reset SCT0 */
#define SYSCON_PRESETCTRL1_UTICK               (1 << 10) /* Bit 10: Reset the Micro-tick Timer */
#define SYSCON_PRESETCTRL1_FLEXCOMM0           (1 << 11) /* Bit 11: Reset Flexcomm Interface 0 */
#define SYSCON_PRESETCTRL1_FLEXCOMM1           (1 << 12) /* Bit 12: Reset Flexcomm Interface 1 */
#define SYSCON_PRESETCTRL1_FLEXCOMM2           (1 << 13) /* Bit 13: Reset Flexcomm Interface 2 */
#define SYSCON_PRESETCTRL1_FLEXCOMM3           (1 << 14) /* Bit 14: Reset Flexcomm Interface 3 */
#define SYSCON_PRESETCTRL1_FLEXCOMM4           (1 << 15) /* Bit 15: Reset Flexcomm Interface 4 */
#define SYSCON_PRESETCTRL1_FLEXCOMM5           (1 << 16) /* Bit 16: Reset Flexcomm Interface 5 */
#define SYSCON_PRESETCTRL1_FLEXCOMM6           (1 << 17) /* Bit 17: Reset Flexcomm Interface 6 */
#define SYSCON_PRESETCTRL1_FLEXCOMM7           (1 << 18) /* Bit 18: Reset Flexcomm Interface 7 */
#define SYSCON_PRESETCTRL1_CTIMER2             (1 << 22) /* Bit 22: Reset CTIMER 2 */
#define SYSCON_PRESETCTRL1_USB0D               (1 << 25) /* Bit 25: Reset the USB0 device interface */
#define SYSCON_PRESETCTRL1_CTIMER0             (1 << 26) /* Bit 26: Reset timer CTIMER0 */
#define SYSCON_PRESETCTRL1_CTIMER1             (1 << 27) /* Bit 27: Reset timer CTIMER1 */

/* Peripheral reset control 2: PRESETCTRL2, PRESETCTRL2, and PRESETCTRLCLR2 */

#define SYSCON_PRESETCTRL2_DMA1                (1 << 1)  /* Bit 1:  Reset the DMA1 interface */
#define SYSCON_PRESETCTRL2_COMP                (1 << 2)  /* Bit 2:  Reset the COMP interface */
#define SYSCON_PRESETCTRL2_SDIO                (1 << 3)  /* Bit 3:  Reset the SDIO interface */
#define SYSCON_PRESETCTRL2_USB1H               (1 << 4)  /* Bit 4:  Reset the USB1 host interface */
#define SYSCON_PRESETCTRL2_USB1D               (1 << 5)  /* Bit 5:  Reset the USB1 device interface */
#define SYSCON_PRESETCTRL2_USB1RAM             (1 << 6)  /* Bit 6:  Reset the USB1 RAM interface */
#define SYSCON_PRESETCTRL2_USB1PHY             (1 << 7)  /* Bit 7:  Reset the USB1 PHY interface */
#define SYSCON_PRESETCTRL2_FREQME              (1 << 8)  /* Bit 8:  Reset the frequency meter interface */
#define SYSCON_PRESETCTRL2_RNG                 (1 << 13) /* Bit 13: Reset the RNG interface */
#define SYSCON_PRESETCTRL2_SYSCTL              (1 << 15) /* Bit 15: Reset the SYSCTL block */
#define SYSCON_PRESETCTRL2_USB0HMR             (1 << 16) /* Bit 16: Reset the USB host master interface */
#define SYSCON_PRESETCTRL2_USB0HSL             (1 << 17) /* Bit 17: Reset the USB host slave interface */
#define SYSCON_PRESETCTRL2_HASHAES             (1 << 18) /* Bit 18: Reset the HASH AES interface */
#define SYSCON_PRESETCTRL2_PQ                  (1 << 19) /* Bit 19: Reset the power quad interface */
#define SYSCON_PRESETCTRL2_PLULUT              (1 << 20) /* Bit 20: Reset the PLU LUT interface */
#define SYSCON_PRESETCTRL2_CTIMER3             (1 << 21) /* Bit 21: Reset timer CTIMER3 */
#define SYSCON_PRESETCTRL2_CTIMER4             (1 << 22) /* Bit 22: Reset timer CTIMER4 */
#define SYSCON_PRESETCTRL2_PUF                 (1 << 23) /* Bit 23: Reset PUF interface */
#define SYSCON_PRESETCTRL2_CASPER              (1 << 24) /* Bit 24: Reset CASPER interface */
#define SYSCON_PRESETCTRL2_ANALOG              (1 << 27) /* Bit 27: Reset Analog interface */
#define SYSCON_PRESETCTRL2_HSLSPI              (1 << 28) /* Bit 28: Reset HP SPI interface */
#define SYSCON_PRESETCTRL2_GPIOSEC             (1 << 29) /* Bit 29: Reset GPIO secure interface */
#define SYSCON_PRESETCTRL2_GPIOSECINT          (1 << 30) /* Bit 30: Reset GPIO Secure int interface */

/* AHB Clock control 0: AHBCLKCTRL0, AHBCLKCTRLCLR0, and AHBCLKCTRLSET0 */

#define SYSCON_AHBCLKCTRL0_ROM                 (1 << 1)  /* Bit 1:  Enables the clock for the Boot ROM */
#define SYSCON_AHBCLKCTRL0_SRAM1               (1 << 3)  /* Bit 3:  Enables the clock for SRAM1 */
#define SYSCON_AHBCLKCTRL0_SRAM2               (1 << 4)  /* Bit 4:  Enables the clock for SRAM2 */
#define SYSCON_AHBCLKCTRL0_SRAM3               (1 << 5)  /* Bit 5:  Enables the clock for SRAM3 */
#define SYSCON_AHBCLKCTRL0_SRAM4               (1 << 5)  /* Bit 6:  Enables the clock for SRAM4 */
#define SYSCON_AHBCLKCTRL0_FLASH               (1 << 7)  /* Bit 7:  Enables the clock for the flash controller */
#define SYSCON_AHBCLKCTRL0_FMC                 (1 << 8)  /* Bit 8:  Enables the clock for the Flash accelerator */
#define SYSCON_AHBCLKCTRL0_INPUTMUX            (1 << 11) /* Bit 11: Enables the clock for the input muxes */
#define SYSCON_AHBCLKCTRL0_IOCON               (1 << 13) /* Bit 13: Enables the clock for the IOCON block */
#define SYSCON_AHBCLKCTRL0_GPIO0               (1 << 14) /* Bit 14: Enables the clock for the GPIO0 port registers */
#define SYSCON_AHBCLKCTRL0_GPIO1               (1 << 15) /* Bit 15: Enables the clock for the GPIO1 port registers */
#define SYSCON_AHBCLKCTRL0_GPIO2               (1 << 16) /* Bit 16: Enables the clock for the GPIO2 port registers */
#define SYSCON_AHBCLKCTRL0_GPIO3               (1 << 17) /* Bit 17: Enables the clock for the GPIO3 port registers */
#define SYSCON_AHBCLKCTRL0_PINT                (1 << 18) /* Bit 18: Enables the clock for the pin interrupt block */
#define SYSCON_AHBCLKCTRL0_GINT                (1 << 19) /* Bit 19: Enables the clock for the grouped pin interrupt block */
#define SYSCON_AHBCLKCTRL0_DMA0                (1 << 20) /* Bit 20: Enables the clock for the DMA0 controller */
#define SYSCON_AHBCLKCTRL0_CRC                 (1 << 21) /* Bit 21: Enables the clock for the CRC engine */
#define SYSCON_AHBCLKCTRL0_WWDT                (1 << 22) /* Bit 22: Enables the clock for the Watchdog Timer */
#define SYSCON_AHBCLKCTRL0_RTC                 (1 << 23) /* Bit 23: Enables the bus clock for the RTC */
#define SYSCON_AHBCLKCTRL0_MAILBOX             (1 << 26) /* Bit 26: Enables the clock for the inter-cpu mailbox interface */
#define SYSCON_AHBCLKCTRL0_ADC0                (1 << 27) /* Bit 27: Enables the clock for the ADC0 register interface */

/* AHB Clock control 1: AHBCLKCTRL1, AHBCLKCTRLCLR1, and AHBCLKCTRLSET1 */

#define SYSCON_AHBCLKCTRL1_MRT                 (1 << 0)  /* Bit 0:  Enables the clock for the Multi-Rate Timer */
#define SYSCON_AHBCLKCTRL1_OSTIMER             (1 << 1)  /* Bit 1:  Enables the clock for the OS Event Timer */
#define SYSCON_AHBCLKCTRL1_SCT0                (1 << 2)  /* Bit 2:  Enables the clock for SCT0 */
#define SYSCON_AHBCLKCTRL1_UTICK               (1 << 10) /* Bit 10: Enables the clock for the Micro-tick Timer */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM0           (1 << 11) /* Bit 11: Enables the clock for Flexcomm Interface 0 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM1           (1 << 12) /* Bit 12: Enables the clock for Flexcomm Interface 1 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM2           (1 << 13) /* Bit 13: Enables the clock for Flexcomm Interface 2 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM3           (1 << 14) /* Bit 14: Enables the clock for Flexcomm Interface 3 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM4           (1 << 15) /* Bit 15: Enables the clock for Flexcomm Interface 4 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM5           (1 << 16) /* Bit 16: Enables the clock for Flexcomm Interface 5 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM6           (1 << 17) /* Bit 17: Enables the clock for Flexcomm Interface 6 */
#define SYSCON_AHBCLKCTRL1_FLEXCOMM7           (1 << 18) /* Bit 18: Enables the clock for Flexcomm Interface 7 */
#define SYSCON_AHBCLKCTRL1_CTIMER2             (1 << 22) /* Bit 22: Enables the clock for CTIMER 2 */
#define SYSCON_AHBCLKCTRL1_USB0D               (1 << 25) /* Bit 25: Enables the clock for the USB0 device interface */
#define SYSCON_AHBCLKCTRL1_CTIMER0             (1 << 26) /* Bit 26: Enables the clock for timer CTIMER0 */
#define SYSCON_AHBCLKCTRL1_CTIMER1             (1 << 27) /* Bit 27: Enables the clock for timer CTIMER1 */

