apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_syscon.h
/* AHB Clock control 2: AHBCLKCTRL2, AHBCLKCTRLCLR2, and AHBCLKCTRLSET2 */

#define SYSCON_AHBCLKCTRL2_DMA1                (1 << 1)  /* Bit 1:  Enables the clock for the DMA1 interface */
#define SYSCON_AHBCLKCTRL2_COMP                (1 << 2)  /* Bit 2:  Enables the clock for the LCD interface */
#define SYSCON_AHBCLKCTRL2_SDIO                (1 << 3)  /* Bit 3:  Enables the clock for the SDIO interface */
#define SYSCON_AHBCLKCTRL2_USB1H               (1 << 4)  /* Bit 4:  Enables the clock for the USB1 host interface */
#define SYSCON_AHBCLKCTRL2_USB1D               (1 << 5)  /* Bit 5:  Enables the clock for the USB1 device interface */
#define SYSCON_AHBCLKCTRL2_USB1RAM             (1 << 6)  /* Bit 6:  Enables the clock for the USB1 RAM interface */
#define SYSCON_AHBCLKCTRL2_USB1PHY             (1 << 7)  /* Bit 7:  Enables the clock for the USB1 PHY interface */
#define SYSCON_AHBCLKCTRL2_FREQME              (1 << 8)  /* Bit 8:  Enables the clock for the FREQME interface */
#define SYSCON_AHBCLKCTRL2_RNG                 (1 << 13) /* Bit 13: Enables the clock for the RNG interface */
#define SYSCON_AHBCLKCTRL2_SYSCTL              (1 << 15) /* Bit 15: Enables the clock for the SYSCTL Interface 9 */
#define SYSCON_AHBCLKCTRL2_USB0HMR             (1 << 16) /* Bit 16: Enables the clock for the USB host master interface */
#define SYSCON_AHBCLKCTRL2_USB0HSL             (1 << 17) /* Bit 17: Enables the clock for the USB host slave interface */
#define SYSCON_AHBCLKCTRL2_HASHAES             (1 << 18) /* Bit 18: Enables the clock for the HASH_AES interface */
#define SYSCON_AHBCLKCTRL2_PQ                  (1 << 19) /* Bit 19: Enables the clock for the power quad interface */
#define SYSCON_AHBCLKCTRL2_PLULUT              (1 << 20) /* Bit 20: Enables the clock for the PLU LUT interface */
#define SYSCON_AHBCLKCTRL2_CTIMER3             (1 << 21) /* Bit 21: Enables the clock for the CTIMER3 interface */
#define SYSCON_AHBCLKCTRL2_CTIMER4             (1 << 22) /* Bit 22: Enables the clock for the CTIMER4 interface */
#define SYSCON_AHBCLKCTRL2_PUF                 (1 << 23) /* Bit 23: Enables the clock for the PUF interface */
#define SYSCON_AHBCLKCTRL2_CASPER              (1 << 24) /* Bit 24: Enables the clock for the CASPER interface */
#define SYSCON_AHBCLKCTRL2_ANALOG              (1 << 27) /* Bit 27: Enables the clock for the ANALOG interface */
#define SYSCON_AHBCLKCTRL2_HSLSPI              (1 << 28) /* Bit 28: Enables the clock for the HS SPI interface */
#define SYSCON_AHBCLKCTRL2_GPIOSEC             (1 << 29) /* Bit 29: Enables the clock for the GPIO Secure interface */
#define SYSCON_AHBCLKCTRL2_GPIOSECINT          (1 << 30) /* Bit 30: Enables the clock for the GPIO Secure int interface */

/* System tick timer for CPU0/1 source select */

#define SYSCON_SYSTICKCLKSEL_SHIFT             (0)       /* Bits 0-2:  Clock source for system tick clock */
#define SYSCON_SYSTICKCLKSEL_MASK              (7 << SYSCON_SYSTICKCLKSEL_SHIFT)
#  define SYSCON_SYSTICKCLKSEL_DIV0            (0 << SYSCON_SYSTICKCLKSEL_SHIFT) /* System tick timer divided clk */
#  define SYSCON_SYSTICKCLKSEL_FRO1            (1 << SYSCON_SYSTICKCLKSEL_SHIFT) /* FRO 1 MHz (fro_1m) */
#  define SYSCON_SYSTICKCLKSEL_RTC             (2 << SYSCON_SYSTICKCLKSEL_SHIFT) /* 32kHz oscillator */
#  define SYSCON_SYSTICKCLKSEL_NONE            (7 << SYSCON_SYSTICKCLKSEL_SHIFT) /* None */

/* Trace clock source select */

#define SYSCON_TRACECLKSEL_SHIFT               (0)       /* Bits 0-2:  Clock source for trace clock */
#define SYSCON_TRACECLKSEL_MASK                (7 << SYSCON_TRACECLKSEL_SHIFT)
#  define SYSCON_TRACECLKSEL_DIV0              (0 << SYSCON_TRACECLKSEL_SHIFT) /* trace divided clk */
#  define SYSCON_TRACECLKSEL_FRO1              (1 << SYSCON_TRACECLKSEL_SHIFT) /* FRO 1 MHz (fro_1m) */
#  define SYSCON_TRACECLKSEL_RTC               (2 << SYSCON_TRACECLKSEL_SHIFT) /* 32kHz oscillator */
#  define SYSCON_TRACECLKSEL_NONE              (7 << SYSCON_TRACECLKSEL_SHIFT) /* None */

/* Main clock source select A */

#define SYSCON_MAINCLKSELA_SHIFT               (0)       /* Bits 0-1:  Clock source for main clock */
#define SYSCON_MAINCLKSELA_MASK                (7 << SYSCON_MAINCLKSELA_SHIFT)
#  define SYSCON_MAINCLKSELA_FRO12             (0 << SYSCON_MAINCLKSELA_SHIFT) /* FRO 12 MHz (fro_12m) */
#  define SYSCON_MAINCLKSELA_CLKIN             (1 << SYSCON_MAINCLKSELA_SHIFT) /* CLKIN (clk_in) */
#  define SYSCON_MAINCLKSELA_FRO1              (2 << SYSCON_MAINCLKSELA_SHIFT) /* FRO 1 MHz (fro_1m) */
#  define SYSCON_MAINCLKSELA_FROHF             (3 << SYSCON_MAINCLKSELA_SHIFT) /* FRO 96 (fro_hf) */

/* Main clock source select B */

#define SYSCON_MAINCLKSELB_SHIFT               (0)       /* Bits 0-1: Clock source for main clock */
#define SYSCON_MAINCLKSELB_MASK                (7 << SYSCON_MAINCLKSELB_SHIFT)
#  define SYSCON_MAINCLKSELB_MAINCLKSELA       (0 << SYSCON_MAINCLKSELB_SHIFT) /* Use MAINCLKSELA selection */
#  define SYSCON_MAINCLKSELB_PLL0CLK           (1 << SYSCON_MAINCLKSELB_SHIFT) /* System PLL0 output (pll0_clk) */
#  define SYSCON_MAINCLKSELB_PLL1CLK           (2 << SYSCON_MAINCLKSELB_SHIFT) /* System PLL1 output (pll1_clk) */
#  define SYSCON_MAINCLKSELB_RTC               (3 << SYSCON_MAINCLKSELB_SHIFT) /* RTC oscillator 32 kHz output (32k_clk) */

/* PLL0/1 clock source select */

#define SYSCON_PLLCLKSEL_SHIFT                 (0)       /* Bits 0-2: System PLL clock source selection */
#define SYSCON_PLLCLKSEL_MASK                  (7 << SYSCON_PLLCLKSEL_SHIFT)
#  define SYSCON_PLLCLKSEL_FFRO                (0 << SYSCON_PLLCLKSEL_SHIFT) /* FRO 12 MHz (fro_12m) */
#  define SYSCON_PLLCLKSEL_CLKIN               (1 << SYSCON_PLLCLKSEL_SHIFT) /* CLKIN (clk_in) */
#  define SYSCON_PLLCLKSEL_FRO1                (2 << SYSCON_PLLCLKSEL_SHIFT) /* FRO 1 MHz (fro_1m) */
#  define SYSCON_PLLCLKSEL_RTC                 (3 << SYSCON_PLLCLKSEL_SHIFT) /* RTC oscillator 32 KHz output */
#  define SYSCON_PLLCLKSEL_NONE                (7 << SYSCON_PLLCLKSEL_SHIFT) /* None */

/* Flexcomm Interface 0..7 clock source select */

