apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_syscon.h
#define SYSCON_FCLKSEL_SHIFT                   (0)     /* Bits 0-2: Flexcomm Interface clock source selection */
#define SYSCON_FCLKSEL_MASK                    (7 << SYSCON_FCLKSEL_SHIFT)
#  define SYSCON_FCLKSEL_MAIN                  (0 << SYSCON_FCLKSEL_SHIFT) /* Main clock */
#  define SYSCON_FCLKSEL_SYSPLL                (1 << SYSCON_FCLKSEL_SHIFT) /* System PLL */
#  define SYSCON_FCLKSEL_FRO12                 (2 << SYSCON_FCLKSEL_SHIFT) /* FRO 12 MHz (fro_12m) */
#  define SYSCON_FCLKSEL_FRO96                 (3 << SYSCON_FCLKSEL_SHIFT) /* FRO 96 MHz (fro_96m) */
#  define SYSCON_FCLKSEL_FRO1                  (4 << SYSCON_FCLKSEL_SHIFT) /* FRO 1 MHz  (fro_1m) */
#  define SYSCON_FCLKSEL_MCLK                  (5 << SYSCON_FCLKSEL_SHIFT) /* MCLK */
#  define SYSCON_FCLKSEL_RTC                   (6 << SYSCON_FCLKSEL_SHIFT) /* RTC oscillator 32 KHz output */
#  define SYSCON_FCLKSEL_NONE                  (7 << SYSCON_FCLKSEL_SHIFT) /* None */

/* MCLK clock source select */

#define SYSCON_MCLKCLKSEL_SHIFT                (0)     /* Bits 0-2: MCLK source select */
#define SYSCON_MCLKCLKSEL_MASK                 (7 << SYSCON_MCLKCLKSEL_SHIFT)
#  define SYSCON_MCLKCLKSEL_FRO96              (0 << SYSCON_MCLKCLKSEL_SHIFT) /* FRO 96MHz (fro_96m) */
#  define SYSCON_MCLKCLKSEL_PLL0               (1 << SYSCON_MCLKCLKSEL_SHIFT) /* PLL0 */
#  define SYSCON_MCLKCLKSEL_NONE               (7 << SYSCON_MCLKCLKSEL_SHIFT) /* None */

/* SYSTICK clock divider */

#define SYSCON_SYSTICKCLKDIV_DIV_SHIFT         (0)       /* Bits 0-7: Clock divider value */
#define SYSCON_SYSTICKCLKDIV_DIV_MASK          (0xff << SYSCON_SYSTICKCLKDIV_DIV_SHIFT)
#  define SYSCON_SYSTICKCLKDIV_DIV(n)          ((uint32_t)((n)-1) << SYSCON_SYSTICKCLKDIV_DIV_SHIFT)
#define SYSCON_SYSTICKCLKDIV_RESET             (1 << 29) /* Bit 29: Resets the divider counter */
#define SYSCON_SYSTICKCLKDIV_HALT              (1 << 30) /* Bit 30: Halts the divider counter */
#define SYSCON_SYSTICKCLKDIV_REQFLAG           (1 << 31) /* Bit 31: Divider status flag */

/* System clock divider */

#define SYSCON_AHBCLKDIV_DIV_SHIFT             (0)       /* Bits 0-7: Clock divider value */
#define SYSCON_AHBCLKDIV_DIV_MASK              (0xff << SYSCON_AHBCLKDIV_DIV_SHIFT)
#  define SYSCON_AHBCLKDIV_DIV(n)              ((uint32_t)((n)-1) << SYSCON_AHBCLKDIV_DIV_SHIFT)
#define SYSCON_AHBCLKDIV_RESET                 (1 << 29) /* Bit 29: Resets the divider counter */
#define SYSCON_AHBCLKDIV_HALT                  (1 << 30) /* Bit 30: Halts the divider counter */
#define SYSCON_AHBCLKDIV_REQFLAG               (1 << 31) /* Bit 32: Divider status flag */

/* Fractional rate divider */

#define SYSCON_FRGCTRL_DIV_SHIFT               (0)       /*  Bits 0-7: Denominator of the fractional divider */
#define SYSCON_FRGCTRL_DIV_MASK                (0xff << SYSCON_FRGCTRL_DIV_SHIFT)
#  define SYSCON_FRGCTRL_DIV(n)                ((uint32_t)((n)-1) << SYSCON_FRGCTRL_DIV_SHIFT)
#define SYSCON_FRGCTRL_MULT_SHIFT              (8)       /* Bit 8-15: Numerator of the fractional divider */
#define SYSCON_FRGCTRL_MULT_MASK               (0xff << SYSCON_FRGCTRL_MULT_SHIFT)
#  define SYSCON_FRGCTRL_MULT(n)               ((uint32_t)(n) << SYSCON_FRGCTRL_MULT_SHIFT)

/* PLL0 clock divider */

#define SYSCON_PLL0CLKDIV_DIV_SHIFT            (0)       /* Bits 0-7: Clock divider value */
#define SYSCON_PLL0CLKDIV_DIV_MASK             (0xff << SYSCON_PLL0CLKDIV_DIV_SHIFT)
#  define SYSCON_PLL0CLKDIV_DIV(n)             ((uint32_t)((n)-1) << SYSCON_PLL0CLKDIV_DIV_SHIFT)
#define SYSCON_PLL0CLKDIV_RESET                (1 << 29) /* Bit 29: Resets the divider counter */
#define SYSCON_PLL0CLKDIV_HALT                 (1 << 30) /* Bit 30: Halts the divider counter */
#define SYSCON_PLL0CLKDIV_REQFLAG              (1 << 31) /* Bit 31: Divider status flag */

/* Clock configuration regiser access */

#define SYSCON_CLOCKGENUPDATE_LOCK             (0)
#define SYSCON_CLOCKGENUPDATE_UNLOCK           (1)

/* System PLL control */

#define SYSCON_PLLCTRL_SELR_SHIFT              (0)       /* Bits 0-3: Bandwidth select R value */
#define SYSCON_PLLCTRL_SELR_MASK               (15 << SYSCON_PLLCTRL_SELR_SHIFT)
#  define SYSCON_PLLCTRL_SELR(n)               ((uint32_t)(n) << SYSCON_PLLCTRL_SELR_SHIFT)
#define SYSCON_PLLCTRL_SELI_SHIFT              (4)       /* Bits 4-9: Bandwidth select I value */
#define SYSCON_PLLCTRL_SELI_MASK               (0x3f << SYSCON_PLLCTRL_SELR_SHIFT)
#  define SYSCON_PLLCTRL_SELI(n)               ((uint32_t)(n) << SYSCON_PLLCTRL_SELR_SHIFT)
#define SYSCON_PLLCTRL_SELP_SHIFT              (10)      /* Bits 10-14: Bandwidth select P value */
#define SYSCON_PLLCTRL_SELP_MASK               (0x1f << SYSCON_PLLCTRL_SELR_SHIFT)
#  define SYSCON_PLLCTRL_SELP(n)               ((uint32_t)(n) << SYSCON_PLLCTRL_SELR_SHIFT)
#define SYSCON_PLLCTRL_BYPASS                  (1 << 15) /* Bit 15: PLL bypass control */
#define SYSCON_PLLCTRL_BYPASSPOST              (1 << 16) /* Bit 16: PLL bypass post div 2 control */
#define SYSCON_PLLCTRL_UPLIMOFF                (1 << 17) /* Bit 17: Disable upper frequency limiter */
#define SYSCON_PLLCTRL_DIRECTI                 (1 << 19) /* Bit 19: PLL direct input enable */
#define SYSCON_PLLCTRL_DIRECTO                 (1 << 20) /* Bit 20: PLL direct output enable */
#define SYSCON_PLLCTRL_CLKEN                   (1 << 21) /* Bit 21: Enable output clock */
#define SYSCON_PLLCTRL_FRMEN                   (1 << 22) /* Bit 22: Enable free running */
#define SYSCON_PLLCTRL_FRMCLKSTABLE            (1 << 23) /* Bit 23: Free running clock stable */
#define SYSCON_PLLCTRL_SKEWEN                  (1 << 24) /* Bit 24: Skew mode enable */

/* PLL status */

#define SYSCON_PLLSTAT_LOCK                    (1 << 0)  /* Bit 0: PLL lock indicator */
#define SYSCON_PLLSTAT_PREDIVACK               (1 << 1)  /* Bit 1: Pre-div ratio change ack */
#define SYSCON_PLLSTAT_FEEDDIVACK              (1 << 2)  /* Bit 2: Feedback ratio change ack */
#define SYSCON_PLLSTAT_POSTDIVACK              (1 << 3)  /* Bit 3: Post-div radio change ack */
#define SYSCON_PLLSTAT_FRMDET                  (1 << 4)  /* Bit 4: Free running detector output */


/* PLL N divider */

#define SYSCON_PLLNDEC_NDEC_SHIFT              (0)       /* Bits 0-7: Decoded N-divider coefficient */
#define SYSCON_PLLNDEC_NDEC_MASK               (0xff << SYSCON_PLLNDEC_NDEC_SHIFT)
#  define SYSCON_PLLNDEC_NDEC(n)               ((uint32_t)(n) << SYSCON_PLLNDEC_NDEC_SHIFT)
#define SYSCON_PLLNDEC_NREQ                    (1 << 8)  /* Bit 8:  NREQ reload request */

/* PLL P divider */

#define SYSCON_PLLPDEC_PDEC_SHIFT              (0)       /* Bits 0-4: Decoded P-divider coefficient */
#define SYSCON_PLLPDEC_PDEC_MASK               (0x1f << SYSCON_PLLPDEC_PDEC_SHIFT)
#  define SYSCON_PLLPDEC_PDEC(n)               ((uint32_t)(n) << SYSCON_PLLPDEC_PDEC_SHIFT)
#define SYSCON_PLLPDEC_PREQ                    (1 << 5)  /* Bit 5:  PREQ reload request */

/* PLL M divider */

#define SYSCON_PLLMDEC_MDEC_SHIFT              (0)       /* Bits 0-16: Decoded M-divider coefficient */
#define SYSCON_PLLMDEC_MDEC_MASK               (0xffff << SYSCON_PLLMDEC_MDEC_SHIFT)
#  define SYSCON_PLLMDEC_MDEC(n)               ((uint32_t)(n) << SYSCON_PLLMDEC_MDEC_SHIFT)
#define SYSCON_PLLMDEC_MREQ                    (1 << 16) /* Bit 16:  MREQ reload request */

#endif /* __ARCH_ARM_SRC_LPC55XX_HARDWARE_LPC55_SYSCON_H */
